Repository: Maverick696/pwm-fan-control
Catalog: FanCommander/FanCommander/Resources/Strings.*.resx
Languages: it

# FanStarted
source: FanCommander started. PWM on GPIO{pin} at {freq}Hz
it: FanCommander avviato. PWM su GPIO{pin} a {freq}Hz

# FanStopped
source: PWM stopped
it: PWM fermato

# FanMaxSpeed
source: DutyCycle set to max
it: DutyCycle impostato al massimo

# FanSetSpeed
source: DutyCycle set to {duty}
it: DutyCycle impostato a {duty}

# WorkerStarted
source: FanCommander worker started. PWM on GPIO{pin} at {freq}Hz
it: Worker FanCommander avviato. PWM su GPIO{pin} a {freq}Hz

# WorkerHardwareError
source: Hardware initialization error (PWM/GPIO). Check Docker permissions and devices.
it: Errore di inizializzazione hardware (PWM/GPIO). Controlla permessi e device Docker.

# WorkerStopped
source: Shutdown requested. Setting fan to max speed.
it: Terminazione richiesta. Imposto ventola al massimo.

# TempReadError
source: Could not read temperature from thermal zone. Using fallback value.
it: Impossibile leggere la temperatura dal thermal zone. Uso valore di fallback.

# ConsoleTitle
source: PWM FAN Control
it: Controllo PWM Ventola

# ConsoleStatus
source: CPU Temperature: {temp}°C | Fan Speed: {fan}%
it: Temperatura CPU: {temp}°C | Velocità ventola: {fan}%

# ConsoleGraphCollecting
source: Collecting data for graph...
it: Raccolta dati per il grafico...

# ConsoleGraphTime
source: Time →
it: Tempo →

# ConsoleGraphLegend
source: Legend: {redDot} CPU Temperature
it: Legenda: {redDot} Temperatura CPU

# ConsoleGaugeLabel
source: Fan Speed:
it: Velocità ventola:
